/** ================================================================
 * cache.ts
 * Apollo clientのキャッシュを管理
 * @author yano-kentaro
 * @date 2022-08-11
================================================================= */

// ----------------------------------
// import
import { makeVar } from "@apollo/client"

/** ----------------------------------------------------------------
 * タスクの状態管理
 * @author yano-kentaro
 * @date 2022-08-11
----------------------------------------------------------------- */

interface Task {
    title: string
}

export const tasksVar = makeVar<Task[]>([])